In [10]:
import pandas as pd

In [11]:
voos = pd.read_csv('../../data/aulas/juncao_tabelas/voos.csv')
voos.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [35]:
qnt_voos = pd.read_csv('../../data/aulas/juncao_tabelas/quatidade_de_voos.csv')
qnt_voos.tail()

   month  qnt
7    Aug  386
8    Sep  396
9    Oct  376
10   Nov  262
11   Dec  436

In [34]:
pd.merge(voos, qnt_voos, on='month')

     year month  passengers  qnt
0    1949   Jan         112  284
1    1950   Jan         115  284
2    1951   Jan         145  284
3    1952   Jan         171  284
4    1953   Jan         196  284
..    ...   ...         ...  ...
139  1956   Dec         306  436
140  1957   Dec         336  436
141  1958   Dec         337  436
142  1959   Dec         405  436
143  1960   Dec         432  436

[144 rows x 4 columns]

In [38]:
produtos1 = pd.read_csv('../../data/aulas/juncao_tabelas/produtos1.csv', index_col=['id'])
produtos1.head()

              nome  preco
id
1         sabonete    5.4
2   pasta de dente    7.9
3      desodorante   15.4

In [39]:
produtos2 = pd.read_csv('../../data/aulas/juncao_tabelas/produtos2.csv', index_col=['id'])
produtos2.head()

                nome  preco
id
4   escova de dentes   34.2
5          amaciante   37.8
6      condicionador   12.9

In [42]:
produtos = pd.concat([produtos1, produtos2])
produtos.head()

                nome  preco
id
1           sabonete    5.4
2     pasta de dente    7.9
3        desodorante   15.4
4   escova de dentes   34.2
5          amaciante   37.8

In [43]:
vendas = pd.read_csv('../../data/aulas/juncao_tabelas/vendas.csv')
vendas.head()

         data  quantidade  produto_id
0  2022-01-01          10           1
1  2022-01-02           5           2
2  2022-01-03           7           1
3  2022-01-04          12           3

In [45]:
vendas = vendas.join(produtos, on='produto_id')

In [46]:
vendas.head()

         data  quantidade  produto_id            nome  preco
0  2022-01-01          10           1        sabonete    5.4
1  2022-01-02           5           2  pasta de dente    7.9
2  2022-01-03           7           1        sabonete    5.4
3  2022-01-04          12           3     desodorante   15.4

In [48]:
vendas['total'] = vendas.quantidade * vendas.preco

In [49]:
vendas.head()

         data  quantidade  produto_id            nome  preco  total
0  2022-01-01          10           1        sabonete    5.4   54.0
1  2022-01-02           5           2  pasta de dente    7.9   39.5
2  2022-01-03           7           1        sabonete    5.4   37.8
3  2022-01-04          12           3     desodorante   15.4  184.8